app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "image_url", "last_name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    new_user = params.require(:user).permit(:first_name, :last_name, :email, :image_url)
    User.create(new_user)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    user_id = params[:id]
    @user = User.find_by_id(user_id)